In [40]:
import sqlite3

1. connect with database
2. from the connection object, create a cursor object
3. Using the cursor object, call the execute the method with create table

## Create Database

In [3]:
db = sqlite3.connect("DataScience.db")

created dataBase DataScience.db
_________________________________

Cursor 
A cursor is SQL is a temporary work area created in system memory when a
statement is execute

A sql cursor is a set of rows together with a pointer that identifies a current rows

It is a database object to retrieve data from a resolution

In [4]:
cur = db.cursor()

## Creating Table

In [6]:
cur.execute("create table student (id int primary key,name text,marks int)")

In [8]:
cur.execute("select * from student")

<sqlite3.Cursor object at 0x00000200AF769EA0>

## Insert data

In [9]:
cur.execute("insert into student(id,name,marks) values(1,'Tanbir',99)")

In [11]:
db.commit;
# save the changes

In [13]:
print(cur.rowcount,"= Rows Inserted")

1 = Rows Inserted

In [15]:
cur.execute("insert into student(id,name,marks) values(2,'Himanshu',100)")

In [22]:
db.commit()
print(cur.rowcount)
# it is showing 1 record coz we passed only one statement to update

-1

printing all the rows one by one with FOR LOOP. 
using only print statement will not work

In [25]:
results = cur.execute("select * from student")

for row in results:
    print(row)

(1, 'Tanbir', 99)
(2, 'Himanshu', 100)

In [27]:
print(cur.rowcount)

-1

## Multiple Insertion

In [28]:
cur.execute("insert into student values(3,'joshi',100),(4,'roy',100)")

In [29]:
results = cur.execute("select * from student")

In [30]:
for rows in results:
    print(rows)

(1, 'Tanbir', 99)
(2, 'Himanshu', 100)
(3, 'joshi', 100)
(4, 'roy', 100)

Database will be created in the given location

In [47]:
# create dataBase
db1 = sqlite3.connect("C:/Users/tanbsing/Downloads/new.db")

In [48]:
cur1 = db1.cursor()

In [49]:
cur1.execute("create table class (id int primary key,name text)")

In [51]:
cur1.execute("insert into class values(1,'tanb')")

In [53]:
db1.commit;

In [57]:
rslt = cur1.execute("select * from class")

for ro in rslt:
    print(ro)

(1, 'tanb')

In [41]:
import sqlite3

In [42]:
db = sqlite3.connect("tan.db")

In [43]:
cur = db.cursor()

In [6]:
cur.execute("create table Tan(id int,name text)")

In [16]:
cur.execute("insert into Tan(id,name) values(1,'Tanbir Singh'),(2,'Himanshu'),(3,'Arpit'),(4,'Rohan')")

In [17]:
result1 = cur.execute("select * from Tan where id = 1")

In [18]:
for row in result:
    print(row)

(1, 'Tanbir Singh')
(1, 'Tanbir Singh')

In [19]:
result = cur.execute("select * from Tan where id > 1")
for row in result:
    print(row)

(2, 'Himanshu')
(2, 'Himanshu')
(3, 'Arpit')
(4, 'Rohan')

## Limit

In [15]:
#used to limit data which is being showed

In [60]:
resultLimit = cur.execute("select * from Tan limit 3")

for row in resultLimit:
    print(row)

## AND OR

In [34]:
resultName = cur.execute("select * from Tan where name = 'Tanbir Singh'")

for row in resultName:
    print(row)

(1, 'Tanbir Singh')
(1, 'Tanbir Singh')

In [36]:
resultss = cur.execute("select id from Tan where id > 1")

for row in resultss:
    print(row)

(2,)
(2,)
(3,)
(4,)

In [61]:
result = cur.execute("select id from Tan where id = 1 and id = 2")
for row in resultId:
    print(row)

In [62]:
result = cur.execute("select id from Tan where id = 1 or name = 'Tanbir Singh'")
for row in resultId:
    print(row)

In [63]:
result = cur.execute("Select * from Tan order by id")
for row in resultIdd:
    print(row)

### Is Not NULL

IS NULL

In [64]:
result = cur.execute("Select * from Tan where id is not null")

In [65]:
result = cur.execute("Select * from Tan where id is null")

min max

In [2]:
result = cur.execute("Select max(id) from Tan where id is null")

NameError: name 'cur' is not defined

## BETWEEN, SUM, COUNT

In [3]:
# BETWEEN
# result = cur.execute("Select * from Tan where id between 1 and 3")

In [6]:
#SUM
# result = cur.execute("Select sum(id) from Tan")

In [5]:
#COUNT
# result = cur.execute("Select COUNT(id) from Tan")

**LIKE CLAUSE **
Search text start with charachter

In [7]:
#like
# search from second character % -> means upto the end.
# use ____ 4 underscores to show 4 charater's words
# result = cur.execute("Select * from Tan where name like '%_a%'")

In [8]:
#search t in the text doesn't matter where it is.
# result = cur.execute("Select * from Tan where name like '%T%'")

In [9]:
#search and match the last character
# result = cur.execute("Select * from Tan where name like '%h'")

In [13]:
# results.fetchall()
# It will fetch all the data from the DataBase

In [14]:
#results other then 70
# result = cur.execute("Select * from Tan where id NOT in (2)")

## Update

In [16]:
#results = cur.execute("update id SET name = 'TanbSing' where id IN (1,3)")